In [56]:
# Reference https://www.kaggle.com/pylablanche/meteorite-landings-simple-analysis
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

np.random.seed(0)

### 1. Examine dateset

In [84]:
data = pd.read_csv('../input/meteorite-landings.csv')
data.columns = ['name', 'id', 'nametype', 'class', 'mass', 'fall', 'year', 'latitude', 'longitude', 'geo_location']
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45716 entries, 0 to 45715
Data columns (total 10 columns):
name            45716 non-null object
id              45716 non-null int64
nametype        45716 non-null object
class           45716 non-null object
mass            45585 non-null float64
fall            45716 non-null object
year            45428 non-null float64
latitude        38401 non-null float64
longitude       38401 non-null float64
geo_location    38401 non-null object
dtypes: float64(4), int64(1), object(5)
memory usage: 3.5+ MB

In [85]:
data.sample(10)

                              name            ...                         geo_location
12445      Frontier Mountain 97010            ...             (-72.953060, 160.482500)
28764        Northwest Africa 4568            ...                                  NaN
6125               Dar al Gani 360            ...               (27.927500, 15.831170)
28431        Northwest Africa 4188            ...                                  NaN
7565                    Dhofar 194            ...               (18.836670, 54.270000)
23431        Meteorite Hills 00738            ...             (-79.683330, 155.750000)
11628                       Elyria            ...              (38.280000, -97.365000)
33434  Queen Alexandra Range 94648            ...             (-84.000000, 168.000000)
34063  Queen Alexandra Range 97452            ...             (-84.000000, 168.000000)
42789                 Yamato 86035            ...              (-71.500000, 35.666670)

[10 rows x 10 columns]

### **2. Handle missing values**

In [86]:
# discard any entries with lat/long of 0.0
data = data[(data.latitude != 0) & (data.longitude != 0)]

In [87]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 39278 entries, 0 to 45715
Data columns (total 10 columns):
name            39278 non-null object
id              39278 non-null int64
nametype        39278 non-null object
class           39278 non-null object
mass            39147 non-null float64
fall            39278 non-null object
year            39018 non-null float64
latitude        31963 non-null float64
longitude       31963 non-null float64
geo_location    31963 non-null object
dtypes: float64(4), int64(1), object(5)
memory usage: 3.3+ MB

In [88]:
data.sample(10)

                         name            ...                         geo_location
13472  Grove Mountains 020035            ...              (-73.108060, 75.204170)
7919               Dhofar 559            ...               (18.718480, 54.220000)
9474   Elephant Moraine 83236            ...             (-76.328060, 157.201940)
14346  Grove Mountains 022318            ...              (-72.773330, 75.339170)
18501    LaPaz Icefield 03948            ...                                  NaN
42721             Yamato 8425            ...              (-71.500000, 35.666670)
20440       Lewis Cliff 86540            ...             (-84.271210, 161.351330)
7600               Dhofar 229            ...               (19.056670, 54.575000)
38123                  Ultuna            ...               (59.816670, 17.666670)
12581  Geologists Range 99119            ...             (-82.500000, 155.500000)

[10 rows x 10 columns]

In [89]:
# count the number of missing values for each column
missing_values_count = data.isnull().sum()
missing_values_count

name               0
id                 0
nametype           0
class              0
mass             131
fall               0
year             260
latitude        7315
longitude       7315
geo_location    7315
dtype: int64

In [90]:
# count number of meteorites with invalid nametype
data.groupby('nametype').id.count()

nametype
Relict       75
Valid     39203
Name: id, dtype: int64

In [97]:
# discard samples that do not have a valid nametype
data = data[data['nametype'] == 'Valid']
data.groupby('nametype').id.count()

nametype
Valid    39203
Name: id, dtype: int64

In [98]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 39203 entries, 0 to 45715
Data columns (total 10 columns):
name            39203 non-null object
id              39203 non-null int64
nametype        39203 non-null object
class           39203 non-null object
mass            39121 non-null float64
fall            39203 non-null object
year            38944 non-null float64
latitude        31893 non-null float64
longitude       31893 non-null float64
geo_location    31893 non-null object
dtypes: float64(4), int64(1), object(5)
memory usage: 3.3+ MB

In [99]:
data.dropna(inplace=True)
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 31685 entries, 0 to 45715
Data columns (total 10 columns):
name            31685 non-null object
id              31685 non-null int64
nametype        31685 non-null object
class           31685 non-null object
mass            31685 non-null float64
fall            31685 non-null object
year            31685 non-null float64
latitude        31685 non-null float64
longitude       31685 non-null float64
geo_location    31685 non-null object
dtypes: float64(4), int64(1), object(5)
memory usage: 2.7+ MB

/opt/conda/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.